In [1]:
# Parth "Repo Master" Korat
# Geoff Pawlowski
# Ashutosh Sawant

In [2]:
from scipy.stats import linregress
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os
os.getcwd()

'C:\\Users\\Korat-PC\\Desktop\\DATA\\ucsd bootcamp\\projects\\bulldogs-project-1'

In [3]:
# Read in life expectancy dataset
life_expectancy_df = pd.read_csv("Resources\lifeExpectancyAtBirth.csv")

# columns in the dataset
life_expectancy_df.columns

Index(['Location', 'Period', 'Indicator', 'Dim1', 'First Tooltip'], dtype='object')

In [4]:
# Set the Period as the index
life_expectancy_df_period = life_expectancy_df[life_expectancy_df['Dim1'] == 'Both sexes'].set_index('Period')

# Get the number of periods in a given country
life_expectancy_df_year = life_expectancy_df_period['Location'].value_counts()
life_expectancy_df_year

Canada                                5
Eswatini                              4
Turkey                                4
Philippines                           4
Germany                               4
                                     ..
Latvia                                4
Guinea                                4
Venezuela (Bolivarian Republic of)    4
Sudan (until 2011)                    2
Sudan                                 2
Name: Location, Length: 184, dtype: int64

In [5]:
# Find the number of countries with life expectancy data with more than 4 years
sum(life_expectancy_df_year >= 4)

182

In [6]:
# Remove countries with less than 4 years of life expectancy data
life_expectancy_df_clean = life_expectancy_df_period[life_expectancy_df_period['Location'].isin(
                            life_expectancy_df_year[life_expectancy_df_year >= 4].index)]
life_expectancy_df_clean.head()

,Location,Indicator,Dim1,First Tooltip
Period,,,,
2019,Afghanistan,Life expectancy at birth (years),Both sexes,63.21
2015,Afghanistan,Life expectancy at birth (years),Both sexes,61.65
2010,Afghanistan,Life expectancy at birth (years),Both sexes,59.94
2000,Afghanistan,Life expectancy at birth (years),Both sexes,54.99
2019,Albania,Life expectancy at birth (years),Both sexes,78.00

In [7]:
# total number of countries for each year
life_expectancy_df_clean.index.value_counts()

2019    182
2015    182
2010    182
2000    182
1920      1
Name: Period, dtype: int64

In [8]:
# Remove 1920 period from the data set
life_expectancy_df_clean = life_expectancy_df_clean.drop(1920)
life_expectancy_df_clean.index.value_counts()

2019    182
2015    182
2010    182
2000    182
Name: Period, dtype: int64

In [9]:
# Rename columns and reset the index
life_expectancy_df_clean.columns = ['Location', 'Indicator', 'Sex', 'Life Expectancy in Years']
life_expectancy_df_clean = life_expectancy_df_clean.reset_index()
life_expectancy_df_clean.describe()

            Period  Life Expectancy in Years
count   728.000000                728.000000
mean   2011.000000                 70.218736
std       7.111221                  8.689989
min    2000.000000                 31.280000
25%    2007.500000                 64.430000
50%    2012.500000                 72.175000
75%    2016.000000                 76.442500
max    2019.000000                 84.260000

In [10]:
# Get mean life expectancy for each country for the past 9 years.
life_expectancy_df_sort = life_expectancy_df_clean.groupby('Location').mean()['Life Expectancy in Years'].sort_values()

### 10 countries with highest life expectancy

In [11]:
life_expectancy_df_sort.tail(10).to_frame()

             Life Expectancy in Years
Location
Israel                        81.1700
Cyprus                        81.2300
Sweden                        81.2550
Iceland                       81.4625
Singapore                     81.5425
Spain                         81.5800
Italy                         81.6100
Australia                     81.7275
Switzerland                   81.9925
Japan                         82.9200

### 10 countries with lowest life expectancy

In [12]:
life_expectancy_df_sort.head(10).to_frame()

                          Life Expectancy in Years
Location
Lesotho                                    48.4050
Central African Republic                   49.1200
Eswatini                                   51.5650
Somalia                                    53.2225
Haiti                                      53.7475
Zimbabwe                                   54.3050
Mozambique                                 54.5650
Sierra Leone                               55.2950
Zambia                                     56.0200
Guinea-Bissau                              56.0400

In [13]:
# read basicHandWashing.csv
life_handwashing_df = pd.read_csv('Resources/Infrastructure/basicHandWashing.csv')
life_handwashing_df.head()

,Location,Indicator,Period,Dim1,First Tooltip
0,Afghanistan,Population with basic handwashing facilities a...,2017,Total,37.75
1,Afghanistan,Population with basic handwashing facilities a...,2017,Urban,63.58
2,Afghanistan,Population with basic handwashing facilities a...,2017,Rural,29.02
3,Afghanistan,Population with basic handwashing facilities a...,2016,Total,37.67
4,Afghanistan,Population with basic handwashing facilities a...,2016,Urban,63.58

In [14]:
# Drop Indicator and Dim1 column, and get Total for Dim1 only.
life_handwashing_df_clean = life_handwashing_df[life_handwashing_df['Dim1'] == 'Total'].drop(['Indicator', 'Dim1'], axis=1)
life_handwashing_df_clean[life_handwashing_df_clean['Location'] == 'Afghanistan']

       Location  Period  First Tooltip
0   Afghanistan    2017          37.75
3   Afghanistan    2016          37.67
6   Afghanistan    2015          37.59
9   Afghanistan    2014          37.52
12  Afghanistan    2013          37.44
15  Afghanistan    2012          37.37
18  Afghanistan    2011          37.30
21  Afghanistan    2010          37.22
24  Afghanistan    2009          37.15
27  Afghanistan    2008          37.08
30  Afghanistan    2007          37.01
33  Afghanistan    2006          36.94
36  Afghanistan    2005          36.87

Then using .replace() to pool together all Periods for the years 2019, 2015, 2010, 2000.

In [15]:
# using replace to change the Period values
life_handwashing_df_clean = life_handwashing_df_clean.replace([2017, 2016, 2015, 2014, 2013, 2012, 2011, 2010, 2009, 2008, 2007, 2006, 2005, 
                                                               2004, 2003, 2002, 2001, 2000], [2015, 2015, 2015, 2015, 2015, 2010, 2010, 2010, 
                                                                                               2010, 2010, 2000, 2000, 2000, 2000, 2000, 2000, 
                                                                                               2000, 2000])
# groupby the location and period to get the mean for each location and period.
life_handwashing_df_clean = life_handwashing_df_clean.merge(life_expectancy_df_clean, on=['Location', 'Period']).groupby(['Period', 'Location', 
                                                                                                                          'Life Expectancy in Years']).mean()

In [16]:
# change column name and get the dataframe
life_handwashing_df_clean.columns = ['Handwashing Facilities at Home (%)']
life_handwashing_df_clean.reset_index().groupby('Location').mean()

,Period,Life Expectancy in Years,Handwashing Facilities at Home (%)
Location,,,
Afghanistan,2008.333333,58.860000,37.252667
Algeria,2012.500000,76.195000,83.341500
Angola,2012.500000,59.895000,26.147000
Armenia,2008.333333,73.170000,89.189500
Azerbaijan,2012.500000,69.850000,83.240000
...,...,...,...
Vanuatu,2012.500000,64.580000,25.075000
Viet Nam,2008.333333,72.443333,85.381333
Yemen,2012.500000,67.585000,48.681000
Zambia,2012.500000,58.585000,13.511000
Zimbabwe,2012.500000,54.985000,36.866000

In [17]:
# read basicDrinkingWaterServices.csv
life_drinkingwater_df = pd.read_csv('Resources/Infrastructure/basicDrinkingWaterServices.csv')
life_drinkingwater_df.head()

,Location,Period,Indicator,First Tooltip
0,Afghanistan,2017,Population using at least basic drinking-water...,57.32
1,Afghanistan,2016,Population using at least basic drinking-water...,54.84
2,Afghanistan,2015,Population using at least basic drinking-water...,52.39
3,Afghanistan,2014,Population using at least basic drinking-water...,49.96
4,Afghanistan,2013,Population using at least basic drinking-water...,47.56

In [18]:
# Drop Indicator column
life_drinkingwater_df_clean = life_drinkingwater_df.drop('Indicator', axis=1)
life_drinkingwater_df_clean[life_drinkingwater_df_clean['Location'] == 'Afghanistan']

       Location  Period  First Tooltip
0   Afghanistan    2017          57.32
1   Afghanistan    2016          54.84
2   Afghanistan    2015          52.39
3   Afghanistan    2014          49.96
4   Afghanistan    2013          47.56
5   Afghanistan    2012          45.19
6   Afghanistan    2011          42.84
7   Afghanistan    2010          40.52
8   Afghanistan    2009          38.23
9   Afghanistan    2008          35.97
10  Afghanistan    2007          33.73
11  Afghanistan    2006          31.52
12  Afghanistan    2005          29.54
13  Afghanistan    2004          27.56
14  Afghanistan    2003          25.58
15  Afghanistan    2002          23.60
16  Afghanistan    2001          21.62
17  Afghanistan    2000          21.62

In [19]:
# using replace to change the Period values
life_drinkingwater_df_clean = life_drinkingwater_df_clean.replace([2017, 2016, 2015, 2014, 2013, 2012, 2011, 2010, 2009, 2008, 2007, 2006, 2005, 
                                                               2004, 2003, 2002, 2001, 2000], [2015, 2015, 2015, 2015, 2015, 2010, 2010, 2010, 
                                                                                               2010, 2010, 2000, 2000, 2000, 2000, 2000, 2000, 
                                                                                               2000, 2000])
# groupby the location and period to get the mean for each location and period.
life_drinkingwater_df_clean = life_drinkingwater_df_clean.merge(life_expectancy_df_clean, on=['Location', 'Period']).groupby(['Period', 'Location', 
                                                                                                                          'Life Expectancy in Years']).mean()

In [20]:
# change column name and get the dataframe
life_drinkingwater_df_clean.columns = ['Drinking Water Facilities at Home (%)']
life_drinkingwater_df_clean.reset_index().groupby('Location').mean()

,Period,Life Expectancy in Years,Drinking Water Facilities at Home (%)
Location,,,
Afghanistan,2008.333333,58.860000,39.936750
Albania,2008.333333,75.880000,84.481250
Algeria,2008.333333,74.866667,86.651000
Angola,2008.333333,56.363333,24.684167
Antigua and Barbuda,2008.333333,75.550000,97.225000
...,...,...,...
Venezuela (Bolivarian Republic of),2008.333333,74.513333,96.133333
Viet Nam,2008.333333,72.443333,84.972667
Yemen,2008.333333,65.953333,42.239500
Zambia,2008.333333,53.876667,37.146917
Zimbabwe,2008.333333,52.180000,54.455333